{
  "nodes": [
    {
      "op": "null", 
      "param": {}, 
      "name": "ptb_data_32", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "ptb_embed_weight", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "FullyConnected", 
      "param": {
        "no_bias": "True", 
        "num_hidden": "256"
      }, 
      "name": "ptb_embed_32", 
      "inputs": [[0, 0], [1, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "ptb_l1_i2h_weight", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "ptb_l1_i2h_bias", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "FullyConnected", 
      "param": {
        "no_bias": "False", 
        "num_hidden": "1024"
      }, 
      "name": "ptb_lstm_32_i2h", 
      "inputs": [[2, 0], [3, 0], [4, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "ptb_data_31", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "FullyConnected", 
      "param": {
        "no_bias": "True", 
        "num_hidden": "256"
      }, 
      "name": "ptb_embed_31", 
      "inputs": [[6, 0], [1, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "FullyConnected", 
      "param": {
        "no_bias": "False", 
        "num_hidden": "1024"
      }, 
      "name": "ptb_lstm_31_i2h", 
      "inputs": [[7, 0], [3, 0], [4, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "ptb_data_30", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "FullyConnected", 
      "param": {
        "no_bias": "True", 
        "num_hidden": "256"
      }, 
      "name": "ptb_embed_30", 
      "inputs": [[9, 0], [1, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "FullyConnected", 
      "param": {
        "no_bias": "False", 
        "num_hidden": "1024"
      }, 
      "name": "ptb_lstm_30_i2h", 
      "inputs": [[10, 0], [3, 0], [4, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "ptb_data_29", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "FullyConnected", 
      "param": {
        "no_bias": "True", 
        "num_hidden": "256"
      }, 
      "name": "ptb_embed_29", 
      "inputs": [[12, 0], [1, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "FullyConnected", 
      "param": {
        "no_bias": "False", 
        "num_hidden": "1024"
      }, 
      "name": "ptb_lstm_29_i2h", 
      "inputs": [[13, 0], [3, 0], [4, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "ptb_data_28", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "FullyConnected", 
      "param": {
        "no_bias": "True", 
        "num_hidden": "256"
      }, 
      "name": "ptb_embed_28", 
      "inputs": [[15, 0], [1, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "FullyConnected", 
      "param": {
        "no_bias": "False", 
        "num_hidden": "1024"
      }, 
      "name": "ptb_lstm_28_i2h", 
      "inputs": [[16, 0], [3, 0], [4, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "ptb_data_27", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "FullyConnected", 
      "param": {
        "no_bias": "True", 
        "num_hidden": "256"
      }, 
      "name": "ptb_embed_27", 
      "inputs": [[18, 0], [1, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "FullyConnected", 
      "param": {
        "no_bias": "False", 
        "num_hidden": "1024"
      }, 
      "name": "ptb_lstm_27_i2h", 
      "inputs": [[19, 0], [3, 0], [4, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "ptb_data_26", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "FullyConnected", 
      "param": {
        "no_bias": "True", 
        "num_hidden": "256"
      }, 
      "name": "ptb_embed_26", 
      "inputs": [[21, 0], [1, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "FullyConnected", 
      "param": {
        "no_bias": "False", 
        "num_hidden": "1024"
      }, 
      "name": "ptb_lstm_26_i2h", 
      "inputs": [[22, 0], [3, 0], [4, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "ptb_data_25", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "FullyConnected", 
      "param": {
        "no_bias": "True", 
        "num_hidden": "256"
      }, 
      "name": "ptb_embed_25", 
      "inputs": [[24, 0], [1, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "FullyConnected", 
      "param": {
        "no_bias": "False", 
        "num_hidden": "1024"
      }, 
      "name": "ptb_lstm_25_i2h", 
      "inputs": [[25, 0], [3, 0], [4, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "ptb_data_24", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "FullyConnected", 
      "param": {
        "no_bias": "True", 
        "num_hidden": "256"
      }, 
      "name": "ptb_embed_24", 
      "inputs": [[27, 0], [1, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "FullyConnected", 
      "param": {
        "no_bias": "False", 
        "num_hidden": "1024"
      }, 
      "name": "ptb_lstm_24_i2h", 
      "inputs": [[28, 0], [3, 0], [4, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "ptb_data_23", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "FullyConnected", 
      "param": {
        "no_bias": "True", 
        "num_hidden": "256"
      }, 
      "name": "ptb_embed_23", 
      "inputs": [[30, 0], [1, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "FullyConnected", 
      "param": {
        "no_bias": "False", 
        "num_hidden": "1024"
      }, 
      "name": "ptb_lstm_23_i2h", 
      "inputs": [[31, 0], [3, 0], [4, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "ptb_data_22", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "FullyConnected", 
      "param": {
        "no_bias": "True", 
        "num_hidden": "256"
      }, 
      "name": "ptb_embed_22", 
      "inputs": [[33, 0], [1, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "FullyConnected", 
      "param": {
        "no_bias": "False", 
        "num_hidden": "1024"
      }, 
      "name": "ptb_lstm_22_i2h", 
      "inputs": [[34, 0], [3, 0], [4, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "ptb_data_21", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "FullyConnected", 
      "param": {
        "no_bias": "True", 
        "num_hidden": "256"
      }, 
      "name": "ptb_embed_21", 
      "inputs": [[36, 0], [1, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "FullyConnected", 
      "param": {
        "no_bias": "False", 
        "num_hidden": "1024"
      }, 
      "name": "ptb_lstm_21_i2h", 
      "inputs": [[37, 0], [3, 0], [4, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "ptb_data_20", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "FullyConnected", 
      "param": {
        "no_bias": "True", 
        "num_hidden": "256"
      }, 
      "name": "ptb_embed_20", 
      "inputs": [[39, 0], [1, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "FullyConnected", 
      "param": {
        "no_bias": "False", 
        "num_hidden": "1024"
      }, 
      "name": "ptb_lstm_20_i2h", 
      "inputs": [[40, 0], [3, 0], [4, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "ptb_data_19", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "FullyConnected", 
      "param": {
        "no_bias": "True", 
        "num_hidden": "256"
      }, 
      "name": "ptb_embed_19", 
      "inputs": [[42, 0], [1, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "FullyConnected", 
      "param": {
        "no_bias": "False", 
        "num_hidden": "1024"
      }, 
      "name": "ptb_lstm_19_i2h", 
      "inputs": [[43, 0], [3, 0], [4, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "ptb_data_18", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "FullyConnected", 
      "param": {
        "no_bias": "True", 
        "num_hidden": "256"
      }, 
      "name": "ptb_embed_18", 
      "inputs": [[45, 0], [1, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "FullyConnected", 
      "param": {
        "no_bias": "False", 
        "num_hidden": "1024"
      }, 
      "name": "ptb_lstm_18_i2h", 
      "inputs": [[46, 0], [3, 0], [4, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "ptb_data_17", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "FullyConnected", 
      "param": {
        "no_bias": "True", 
        "num_hidden": "256"
      }, 
      "name": "ptb_embed_17", 
      "inputs": [[48, 0], [1, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "FullyConnected", 
      "param": {
        "no_bias": "False", 
        "num_hidden": "1024"
      }, 
      "name": "ptb_lstm_17_i2h", 
      "inputs": [[49, 0], [3, 0], [4, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "ptb_data_16", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "FullyConnected", 
      "param": {
        "no_bias": "True", 
        "num_hidden": "256"
      }, 
      "name": "ptb_embed_16", 
      "inputs": [[51, 0], [1, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "FullyConnected", 
      "param": {
        "no_bias": "False", 
        "num_hidden": "1024"
      }, 
      "name": "ptb_lstm_16_i2h", 
      "inputs": [[52, 0], [3, 0], [4, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "ptb_data_15", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "FullyConnected", 
      "param": {
        "no_bias": "True", 
        "num_hidden": "256"
      }, 
      "name": "ptb_embed_15", 
      "inputs": [[54, 0], [1, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "FullyConnected", 
      "param": {
        "no_bias": "False", 
        "num_hidden": "1024"
      }, 
      "name": "ptb_lstm_15_i2h", 
      "inputs": [[55, 0], [3, 0], [4, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "ptb_data_14", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "FullyConnected", 
      "param": {
        "no_bias": "True", 
        "num_hidden": "256"
      }, 
      "name": "ptb_embed_14", 
      "inputs": [[57, 0], [1, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "FullyConnected", 
      "param": {
        "no_bias": "False", 
        "num_hidden": "1024"
      }, 
      "name": "ptb_lstm_14_i2h", 
      "inputs": [[58, 0], [3, 0], [4, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "ptb_data_13", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "FullyConnected", 
      "param": {
        "no_bias": "True", 
        "num_hidden": "256"
      }, 
      "name": "ptb_embed_13", 
      "inputs": [[60, 0], [1, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "FullyConnected", 
      "param": {
        "no_bias": "False", 
        "num_hidden": "1024"
      }, 
      "name": "ptb_lstm_13_i2h", 
      "inputs": [[61, 0], [3, 0], [4, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "ptb_data_12", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "FullyConnected", 
      "param": {
        "no_bias": "True", 
        "num_hidden": "256"
      }, 
      "name": "ptb_embed_12", 
      "inputs": [[63, 0], [1, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "FullyConnected", 
      "param": {
        "no_bias": "False", 
        "num_hidden": "1024"
      }, 
      "name": "ptb_lstm_12_i2h", 
      "inputs": [[64, 0], [3, 0], [4, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "ptb_data_11", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "FullyConnected", 
      "param": {
        "no_bias": "True", 
        "num_hidden": "256"
      }, 
      "name": "ptb_embed_11", 
      "inputs": [[66, 0], [1, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "FullyConnected", 
      "param": {
        "no_bias": "False", 
        "num_hidden": "1024"
      }, 
      "name": "ptb_lstm_11_i2h", 
      "inputs": [[67, 0], [3, 0], [4, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "ptb_data_10", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "FullyConnected", 
      "param": {
        "no_bias": "True", 
        "num_hidden": "256"
      }, 
      "name": "ptb_embed_10", 
      "inputs": [[69, 0], [1, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "FullyConnected", 
      "param": {
        "no_bias": "False", 
        "num_hidden": "1024"
      }, 
      "name": "ptb_lstm_10_i2h", 
      "inputs": [[70, 0], [3, 0], [4, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "ptb_data_9", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "FullyConnected", 
      "param": {
        "no_bias": "True", 
        "num_hidden": "256"
      }, 
      "name": "ptb_embed_9", 
      "inputs": [[72, 0], [1, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "FullyConnected", 
      "param": {
        "no_bias": "False", 
        "num_hidden": "1024"
      }, 
      "name": "ptb_lstm_9_i2h", 
      "inputs": [[73, 0], [3, 0], [4, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "ptb_data_8", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "FullyConnected", 
      "param": {
        "no_bias": "True", 
        "num_hidden": "256"
      }, 
      "name": "ptb_embed_8", 
      "inputs": [[75, 0], [1, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "FullyConnected", 
      "param": {
        "no_bias": "False", 
        "num_hidden": "1024"
      }, 
      "name": "ptb_lstm_8_i2h", 
      "inputs": [[76, 0], [3, 0], [4, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "ptb_data_7", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "FullyConnected", 
      "param": {
        "no_bias": "True", 
        "num_hidden": "256"
      }, 
      "name": "ptb_embed_7", 
      "inputs": [[78, 0], [1, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "FullyConnected", 
      "param": {
        "no_bias": "False", 
        "num_hidden": "1024"
      }, 
      "name": "ptb_lstm_7_i2h", 
      "inputs": [[79, 0], [3, 0], [4, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "ptb_data_6", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "FullyConnected", 
      "param": {
        "no_bias": "True", 
        "num_hidden": "256"
      }, 
      "name": "ptb_embed_6", 
      "inputs": [[81, 0], [1, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "FullyConnected", 
      "param": {
        "no_bias": "False", 
        "num_hidden": "1024"
      }, 
      "name": "ptb_lstm_6_i2h", 
      "inputs": [[82, 0], [3, 0], [4, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "ptb_data_5", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "FullyConnected", 
      "param": {
        "no_bias": "True", 
        "num_hidden": "256"
      }, 
      "name": "ptb_embed_5", 
      "inputs": [[84, 0], [1, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "FullyConnected", 
      "param": {
        "no_bias": "False", 
        "num_hidden": "1024"
      }, 
      "name": "ptb_lstm_5_i2h", 
      "inputs": [[85, 0], [3, 0], [4, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "ptb_data_4", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "FullyConnected", 
      "param": {
        "no_bias": "True", 
        "num_hidden": "256"
      }, 
      "name": "ptb_embed_4", 
      "inputs": [[87, 0], [1, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "FullyConnected", 
      "param": {
        "no_bias": "False", 
        "num_hidden": "1024"
      }, 
      "name": "ptb_lstm_4_i2h", 
      "inputs": [[88, 0], [3, 0], [4, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "ptb_data_3", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "FullyConnected", 
      "param": {
        "no_bias": "True", 
        "num_hidden": "256"
      }, 
      "name": "ptb_embed_3", 
      "inputs": [[90, 0], [1, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "FullyConnected", 
      "param": {
        "no_bias": "False", 
        "num_hidden": "1024"
      }, 
      "name": "ptb_lstm_3_i2h", 
      "inputs": [[91, 0], [3, 0], [4, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "ptb_data_2", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "FullyConnected", 
      "param": {
        "no_bias": "True", 
        "num_hidden": "256"
      }, 
      "name": "ptb_embed_2", 
      "inputs": [[93, 0], [1, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "FullyConnected", 
      "param": {
        "no_bias": "False", 
        "num_hidden": "1024"
      }, 
      "name": "ptb_lstm_2_i2h", 
      "inputs": [[94, 0], [3, 0], [4, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "ptb_data_1", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "FullyConnected", 
      "param": {
        "no_bias": "True", 
        "num_hidden": "256"
      }, 
      "name": "ptb_embed_1", 
      "inputs": [[96, 0], [1, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "FullyConnected", 
      "param": {
        "no_bias": "False", 
        "num_hidden": "1024"
      }, 
      "name": "ptb_lstm_1_i2h", 
      "inputs": [[97, 0], [3, 0], [4, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "ptb_l1_init_h", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "ptb_l1_h2h_weight", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "ptb_l1_h2h_bias", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "FullyConnected", 
      "param": {
        "no_bias": "False", 
        "num_hidden": "1024"
      }, 
      "name": "ptb_lstm_1_h2h", 
      "inputs": [[99, 0], [100, 0], [101, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "_Plus", 
      "param": {}, 
      "name": "_plus0", 
      "inputs": [[98, 0], [102, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "SliceChannel", 
      "param": {"num_outputs": "4"}, 
      "name": "ptb_lstm_1_gates", 
      "inputs": [[103, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "Activation", 
      "param": {"act_type": "sigmoid"}, 
      "name": "activation3", 
      "inputs": [[104, 3]], 
      "backward_source_id": -1
    }, 
    {
      "op": "Activation", 
      "param": {"act_type": "sigmoid"}, 
      "name": "activation2", 
      "inputs": [[104, 2]], 
      "backward_source_id": -1
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "ptb_l1_init_c", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "_Mul", 
      "param": {}, 
      "name": "_mul0", 
      "inputs": [[106, 0], [107, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "Activation", 
      "param": {"act_type": "sigmoid"}, 
      "name": "activation0", 
      "inputs": [[104, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "Activation", 
      "param": {"act_type": "tanh"}, 
      "name": "activation1", 
      "inputs": [[104, 1]], 
      "backward_source_id": -1
    }, 
    {
      "op": "_Mul", 
      "param": {}, 
      "name": "_mul1", 
      "inputs": [[109, 0], [110, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "_Plus", 
      "param": {}, 
      "name": "_plus1", 
      "inputs": [[108, 0], [111, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "Activation", 
      "param": {"act_type": "tanh"}, 
      "name": "activation4", 
      "inputs": [[112, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "_Mul", 
      "param": {}, 
      "name": "_mul2", 
      "inputs": [[105, 0], [113, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "FullyConnected", 
      "param": {
        "no_bias": "False", 
        "num_hidden": "1024"
      }, 
      "name": "ptb_lstm_2_h2h", 
      "inputs": [[114, 0], [100, 0], [101, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "_Plus", 
      "param": {}, 
      "name": "_plus4", 
      "inputs": [[95, 0], [115, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "SliceChannel", 
      "param": {"num_outputs": "4"}, 
      "name": "ptb_lstm_2_gates", 
      "inputs": [[116, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "Activation", 
      "param": {"act_type": "sigmoid"}, 
      "name": "activation13", 
      "inputs": [[117, 3]], 
      "backward_source_id": -1
    }, 
    {
      "op": "Activation", 
      "param": {"act_type": "sigmoid"}, 
      "name": "activation12", 
      "inputs": [[117, 2]], 
      "backward_source_id": -1
    }, 
    {
      "op": "_Mul", 
      "param": {}, 
      "name": "_mul6", 
      "inputs": [[119, 0], [112, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "Activation", 
      "param": {"act_type": "sigmoid"}, 
      "name": "activation10", 
      "inputs": [[117, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "Activation", 
      "param": {"act_type": "tanh"}, 
      "name": "activation11", 
      "inputs": [[117, 1]], 
      "backward_source_id": -1
    }, 
    {
      "op": "_Mul", 
      "param": {}, 
      "name": "_mul7", 
      "inputs": [[121, 0], [122, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "_Plus", 
      "param": {}, 
      "name": "_plus5", 
      "inputs": [[120, 0], [123, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "Activation", 
      "param": {"act_type": "tanh"}, 
      "name": "activation14", 
      "inputs": [[124, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "_Mul", 
      "param": {}, 
      "name": "_mul8", 
      "inputs": [[118, 0], [125, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "FullyConnected", 
      "param": {
        "no_bias": "False", 
        "num_hidden": "1024"
      }, 
      "name": "ptb_lstm_3_h2h", 
      "inputs": [[126, 0], [100, 0], [101, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "_Plus", 
      "param": {}, 
      "name": "_plus8", 
      "inputs": [[92, 0], [127, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "SliceChannel", 
      "param": {"num_outputs": "4"}, 
      "name": "ptb_lstm_3_gates", 
      "inputs": [[128, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "Activation", 
      "param": {"act_type": "sigmoid"}, 
      "name": "activation23", 
      "inputs": [[129, 3]], 
      "backward_source_id": -1
    }, 
    {
      "op": "Activation", 
      "param": {"act_type": "sigmoid"}, 
      "name": "activation22", 
      "inputs": [[129, 2]], 
      "backward_source_id": -1
    }, 
    {
      "op": "_Mul", 
      "param": {}, 
      "name": "_mul12", 
      "inputs": [[131, 0], [124, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "Activation", 
      "param": {"act_type": "sigmoid"}, 
      "name": "activation20", 
      "inputs": [[129, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "Activation", 
      "param": {"act_type": "tanh"}, 
      "name": "activation21", 
      "inputs": [[129, 1]], 
      "backward_source_id": -1
    }, 
    {
      "op": "_Mul", 
      "param": {}, 
      "name": "_mul13", 
      "inputs": [[133, 0], [134, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "_Plus", 
      "param": {}, 
      "name": "_plus9", 
      "inputs": [[132, 0], [135, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "Activation", 
      "param": {"act_type": "tanh"}, 
      "name": "activation24", 
      "inputs": [[136, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "_Mul", 
      "param": {}, 
      "name": "_mul14", 
      "inputs": [[130, 0], [137, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "FullyConnected", 
      "param": {
        "no_bias": "False", 
        "num_hidden": "1024"
      }, 
      "name": "ptb_lstm_4_h2h", 
      "inputs": [[138, 0], [100, 0], [101, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "_Plus", 
      "param": {}, 
      "name": "_plus12", 
      "inputs": [[89, 0], [139, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "SliceChannel", 
      "param": {"num_outputs": "4"}, 
      "name": "ptb_lstm_4_gates", 
      "inputs": [[140, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "Activation", 
      "param": {"act_type": "sigmoid"}, 
      "name": "activation33", 
      "inputs": [[141, 3]], 
      "backward_source_id": -1
    }, 
    {
      "op": "Activation", 
      "param": {"act_type": "sigmoid"}, 
      "name": "activation32", 
      "inputs": [[141, 2]], 
      "backward_source_id": -1
    }, 
    {
      "op": "_Mul", 
      "param": {}, 
      "name": "_mul18", 
      "inputs": [[143, 0], [136, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "Activation", 
      "param": {"act_type": "sigmoid"}, 
      "name": "activation30", 
      "inputs": [[141, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "Activation", 
      "param": {"act_type": "tanh"}, 
      "name": "activation31", 
      "inputs": [[141, 1]], 
      "backward_source_id": -1
    }, 
    {
      "op": "_Mul", 
      "param": {}, 
      "name": "_mul19", 
      "inputs": [[145, 0], [146, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "_Plus", 
      "param": {}, 
      "name": "_plus13", 
      "inputs": [[144, 0], [147, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "Activation", 
      "param": {"act_type": "tanh"}, 
      "name": "activation34", 
      "inputs": [[148, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "_Mul", 
      "param": {}, 
      "name": "_mul20", 
      "inputs": [[142, 0], [149, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "FullyConnected", 
      "param": {
        "no_bias": "False", 
        "num_hidden": "1024"
      }, 
      "name": "ptb_lstm_5_h2h", 
      "inputs": [[150, 0], [100, 0], [101, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "_Plus", 
      "param": {}, 
      "name": "_plus16", 
      "inputs": [[86, 0], [151, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "SliceChannel", 
      "param": {"num_outputs": "4"}, 
      "name": "ptb_lstm_5_gates", 
      "inputs": [[152, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "Activation", 
      "param": {"act_type": "sigmoid"}, 
      "name": "activation43", 
      "inputs": [[153, 3]], 
      "backward_source_id": -1
    }, 
    {
      "op": "Activation", 
      "param": {"act_type": "sigmoid"}, 
      "name": "activation42", 
      "inputs": [[153, 2]], 
      "backward_source_id": -1
    }, 
    {
      "op": "_Mul", 
      "param": {}, 
      "name": "_mul24", 
      "inputs": [[155, 0], [148, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "Activation", 
      "param": {"act_type": "sigmoid"}, 
      "name": "activation40", 
      "inputs": [[153, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "Activation", 
      "param": {"act_type": "tanh"}, 
      "name": "activation41", 
      "inputs": [[153, 1]], 
      "backward_source_id": -1
    }, 
    {
      "op": "_Mul", 
      "param": {}, 
      "name": "_mul25", 
      "inputs": [[157, 0], [158, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "_Plus", 
      "param": {}, 
      "name": "_plus17", 
      "inputs": [[156, 0], [159, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "Activation", 
      "param": {"act_type": "tanh"}, 
      "name": "activation44", 
      "inputs": [[160, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "_Mul", 
      "param": {}, 
      "name": "_mul26", 
      "inputs": [[154, 0], [161, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "FullyConnected", 
      "param": {
        "no_bias": "False", 
        "num_hidden": "1024"
      }, 
      "name": "ptb_lstm_6_h2h", 
      "inputs": [[162, 0], [100, 0], [101, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "_Plus", 
      "param": {}, 
      "name": "_plus20", 
      "inputs": [[83, 0], [163, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "SliceChannel", 
      "param": {"num_outputs": "4"}, 
      "name": "ptb_lstm_6_gates", 
      "inputs": [[164, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "Activation", 
      "param": {"act_type": "sigmoid"}, 
      "name": "activation53", 
      "inputs": [[165, 3]], 
      "backward_source_id": -1
    }, 
    {
      "op": "Activation", 
      "param": {"act_type": "sigmoid"}, 
      "name": "activation52", 
      "inputs": [[165, 2]], 
      "backward_source_id": -1
    }, 
    {
      "op": "_Mul", 
      "param": {}, 
      "name": "_mul30", 
      "inputs": [[167, 0], [160, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "Activation", 
      "param": {"act_type": "sigmoid"}, 
      "name": "activation50", 
      "inputs": [[165, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "Activation", 
      "param": {"act_type": "tanh"}, 
      "name": "activation51", 
      "inputs": [[165, 1]], 
      "backward_source_id": -1
    }, 
    {
      "op": "_Mul", 
      "param": {}, 
      "name": "_mul31", 
      "inputs": [[169, 0], [170, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "_Plus", 
      "param": {}, 
      "name": "_plus21", 
      "inputs": [[168, 0], [171, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "Activation", 
      "param": {"act_type": "tanh"}, 
      "name": "activation54", 
      "inputs": [[172, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "_Mul", 
      "param": {}, 
      "name": "_mul32", 
      "inputs": [[166, 0], [173, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "FullyConnected", 
      "param": {
        "no_bias": "False", 
        "num_hidden": "1024"
      }, 
      "name": "ptb_lstm_7_h2h", 
      "inputs": [[174, 0], [100, 0], [101, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "_Plus", 
      "param": {}, 
      "name": "_plus24", 
      "inputs": [[80, 0], [175, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "SliceChannel", 
      "param": {"num_outputs": "4"}, 
      "name": "ptb_lstm_7_gates", 
      "inputs": [[176, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "Activation", 
      "param": {"act_type": "sigmoid"}, 
      "name": "activation63", 
      "inputs": [[177, 3]], 
      "backward_source_id": -1
    }, 
    {
      "op": "Activation", 
      "param": {"act_type": "sigmoid"}, 
      "name": "activation62", 
      "inputs": [[177, 2]], 
      "backward_source_id": -1
    }, 
    {
      "op": "_Mul", 
      "param": {}, 
      "name": "_mul36", 
      "inputs": [[179, 0], [172, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "Activation", 
      "param": {"act_type": "sigmoid"}, 
      "name": "activation60", 
      "inputs": [[177, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "Activation", 
      "param": {"act_type": "tanh"}, 
      "name": "activation61", 
      "inputs": [[177, 1]], 
      "backward_source_id": -1
    }, 
    {
      "op": "_Mul", 
      "param": {}, 
      "name": "_mul37", 
      "inputs": [[181, 0], [182, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "_Plus", 
      "param": {}, 
      "name": "_plus25", 
      "inputs": [[180, 0], [183, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "Activation", 
      "param": {"act_type": "tanh"}, 
      "name": "activation64", 
      "inputs": [[184, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "_Mul", 
      "param": {}, 
      "name": "_mul38", 
      "inputs": [[178, 0], [185, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "FullyConnected", 
      "param": {
        "no_bias": "False", 
        "num_hidden": "1024"
      }, 
      "name": "ptb_lstm_8_h2h", 
      "inputs": [[186, 0], [100, 0], [101, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "_Plus", 
      "param": {}, 
      "name": "_plus28", 
      "inputs": [[77, 0], [187, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "SliceChannel", 
      "param": {"num_outputs": "4"}, 
      "name": "ptb_lstm_8_gates", 
      "inputs": [[188, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "Activation", 
      "param": {"act_type": "sigmoid"}, 
      "name": "activation73", 
      "inputs": [[189, 3]], 
      "backward_source_id": -1
    }, 
    {
      "op": "Activation", 
      "param": {"act_type": "sigmoid"}, 
      "name": "activation72", 
      "inputs": [[189, 2]], 
      "backward_source_id": -1
    }, 
    {
      "op": "_Mul", 
      "param": {}, 
      "name": "_mul42", 
      "inputs": [[191, 0], [184, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "Activation", 
      "param": {"act_type": "sigmoid"}, 
      "name": "activation70", 
      "inputs": [[189, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "Activation", 
      "param": {"act_type": "tanh"}, 
      "name": "activation71", 
      "inputs": [[189, 1]], 
      "backward_source_id": -1
    }, 
    {
      "op": "_Mul", 
      "param": {}, 
      "name": "_mul43", 
      "inputs": [[193, 0], [194, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "_Plus", 
      "param": {}, 
      "name": "_plus29", 
      "inputs": [[192, 0], [195, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "Activation", 
      "param": {"act_type": "tanh"}, 
      "name": "activation74", 
      "inputs": [[196, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "_Mul", 
      "param": {}, 
      "name": "_mul44", 
      "inputs": [[190, 0], [197, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "FullyConnected", 
      "param": {
        "no_bias": "False", 
        "num_hidden": "1024"
      }, 
      "name": "ptb_lstm_9_h2h", 
      "inputs": [[198, 0], [100, 0], [101, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "_Plus", 
      "param": {}, 
      "name": "_plus32", 
      "inputs": [[74, 0], [199, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "SliceChannel", 
      "param": {"num_outputs": "4"}, 
      "name": "ptb_lstm_9_gates", 
      "inputs": [[200, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "Activation", 
      "param": {"act_type": "sigmoid"}, 
      "name": "activation83", 
      "inputs": [[201, 3]], 
      "backward_source_id": -1
    }, 
    {
      "op": "Activation", 
      "param": {"act_type": "sigmoid"}, 
      "name": "activation82", 
      "inputs": [[201, 2]], 
      "backward_source_id": -1
    }, 
    {
      "op": "_Mul", 
      "param": {}, 
      "name": "_mul48", 
      "inputs": [[203, 0], [196, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "Activation", 
      "param": {"act_type": "sigmoid"}, 
      "name": "activation80", 
      "inputs": [[201, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "Activation", 
      "param": {"act_type": "tanh"}, 
      "name": "activation81", 
      "inputs": [[201, 1]], 
      "backward_source_id": -1
    }, 
    {
      "op": "_Mul", 
      "param": {}, 
      "name": "_mul49", 
      "inputs": [[205, 0], [206, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "_Plus", 
      "param": {}, 
      "name": "_plus33", 
      "inputs": [[204, 0], [207, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "Activation", 
      "param": {"act_type": "tanh"}, 
      "name": "activation84", 
      "inputs": [[208, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "_Mul", 
      "param": {}, 
      "name": "_mul50", 
      "inputs": [[202, 0], [209, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "FullyConnected", 
      "param": {
        "no_bias": "False", 
        "num_hidden": "1024"
      }, 
      "name": "ptb_lstm_10_h2h", 
      "inputs": [[210, 0], [100, 0], [101, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "_Plus", 
      "param": {}, 
      "name": "_plus36", 
      "inputs": [[71, 0], [211, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "SliceChannel", 
      "param": {"num_outputs": "4"}, 
      "name": "ptb_lstm_10_gates", 
      "inputs": [[212, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "Activation", 
      "param": {"act_type": "sigmoid"}, 
      "name": "activation93", 
      "inputs": [[213, 3]], 
      "backward_source_id": -1
    }, 
    {
      "op": "Activation", 
      "param": {"act_type": "sigmoid"}, 
      "name": "activation92", 
      "inputs": [[213, 2]], 
      "backward_source_id": -1
    }, 
    {
      "op": "_Mul", 
      "param": {}, 
      "name": "_mul54", 
      "inputs": [[215, 0], [208, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "Activation", 
      "param": {"act_type": "sigmoid"}, 
      "name": "activation90", 
      "inputs": [[213, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "Activation", 
      "param": {"act_type": "tanh"}, 
      "name": "activation91", 
      "inputs": [[213, 1]], 
      "backward_source_id": -1
    }, 
    {
      "op": "_Mul", 
      "param": {}, 
      "name": "_mul55", 
      "inputs": [[217, 0], [218, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "_Plus", 
      "param": {}, 
      "name": "_plus37", 
      "inputs": [[216, 0], [219, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "Activation", 
      "param": {"act_type": "tanh"}, 
      "name": "activation94", 
      "inputs": [[220, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "_Mul", 
      "param": {}, 
      "name": "_mul56", 
      "inputs": [[214, 0], [221, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "FullyConnected", 
      "param": {
        "no_bias": "False", 
        "num_hidden": "1024"
      }, 
      "name": "ptb_lstm_11_h2h", 
      "inputs": [[222, 0], [100, 0], [101, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "_Plus", 
      "param": {}, 
      "name": "_plus40", 
      "inputs": [[68, 0], [223, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "SliceChannel", 
      "param": {"num_outputs": "4"}, 
      "name": "ptb_lstm_11_gates", 
      "inputs": [[224, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "Activation", 
      "param": {"act_type": "sigmoid"}, 
      "name": "activation103", 
      "inputs": [[225, 3]], 
      "backward_source_id": -1
    }, 
    {
      "op": "Activation", 
      "param": {"act_type": "sigmoid"}, 
      "name": "activation102", 
      "inputs": [[225, 2]], 
      "backward_source_id": -1
    }, 
    {
      "op": "_Mul", 
      "param": {}, 
      "name": "_mul60", 
      "inputs": [[227, 0], [220, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "Activation", 
      "param": {"act_type": "sigmoid"}, 
      "name": "activation100", 
      "inputs": [[225, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "Activation", 
      "param": {"act_type": "tanh"}, 
      "name": "activation101", 
      "inputs": [[225, 1]], 
      "backward_source_id": -1
    }, 
    {
      "op": "_Mul", 
      "param": {}, 
      "name": "_mul61", 
      "inputs": [[229, 0], [230, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "_Plus", 
      "param": {}, 
      "name": "_plus41", 
      "inputs": [[228, 0], [231, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "Activation", 
      "param": {"act_type": "tanh"}, 
      "name": "activation104", 
      "inputs": [[232, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "_Mul", 
      "param": {}, 
      "name": "_mul62", 
      "inputs": [[226, 0], [233, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "FullyConnected", 
      "param": {
        "no_bias": "False", 
        "num_hidden": "1024"
      }, 
      "name": "ptb_lstm_12_h2h", 
      "inputs": [[234, 0], [100, 0], [101, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "_Plus", 
      "param": {}, 
      "name": "_plus44", 
      "inputs": [[65, 0], [235, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "SliceChannel", 
      "param": {"num_outputs": "4"}, 
      "name": "ptb_lstm_12_gates", 
      "inputs": [[236, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "Activation", 
      "param": {"act_type": "sigmoid"}, 
      "name": "activation113", 
      "inputs": [[237, 3]], 
      "backward_source_id": -1
    }, 
    {
      "op": "Activation", 
      "param": {"act_type": "sigmoid"}, 
      "name": "activation112", 
      "inputs": [[237, 2]], 
      "backward_source_id": -1
    }, 
    {
      "op": "_Mul", 
      "param": {}, 
      "name": "_mul66", 
      "inputs": [[239, 0], [232, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "Activation", 
      "param": {"act_type": "sigmoid"}, 
      "name": "activation110", 
      "inputs": [[237, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "Activation", 
      "param": {"act_type": "tanh"}, 
      "name": "activation111", 
      "inputs": [[237, 1]], 
      "backward_source_id": -1
    }, 
    {
      "op": "_Mul", 
      "param": {}, 
      "name": "_mul67", 
      "inputs": [[241, 0], [242, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "_Plus", 
      "param": {}, 
      "name": "_plus45", 
      "inputs": [[240, 0], [243, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "Activation", 
      "param": {"act_type": "tanh"}, 
      "name": "activation114", 
      "inputs": [[244, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "_Mul", 
      "param": {}, 
      "name": "_mul68", 
      "inputs": [[238, 0], [245, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "FullyConnected", 
      "param": {
        "no_bias": "False", 
        "num_hidden": "1024"
      }, 
      "name": "ptb_lstm_13_h2h", 
      "inputs": [[246, 0], [100, 0], [101, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "_Plus", 
      "param": {}, 
      "name": "_plus48", 
      "inputs": [[62, 0], [247, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "SliceChannel", 
      "param": {"num_outputs": "4"}, 
      "name": "ptb_lstm_13_gates", 
      "inputs": [[248, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "Activation", 
      "param": {"act_type": "sigmoid"}, 
      "name": "activation123", 
      "inputs": [[249, 3]], 
      "backward_source_id": -1
    }, 
    {
      "op": "Activation", 
      "param": {"act_type": "sigmoid"}, 
      "name": "activation122", 
      "inputs": [[249, 2]], 
      "backward_source_id": -1
    }, 
    {
      "op": "_Mul", 
      "param": {}, 
      "name": "_mul72", 
      "inputs": [[251, 0], [244, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "Activation", 
      "param": {"act_type": "sigmoid"}, 
      "name": "activation120", 
      "inputs": [[249, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "Activation", 
      "param": {"act_type": "tanh"}, 
      "name": "activation121", 
      "inputs": [[249, 1]], 
      "backward_source_id": -1
    }, 
    {
      "op": "_Mul", 
      "param": {}, 
      "name": "_mul73", 
      "inputs": [[253, 0], [254, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "_Plus", 
      "param": {}, 
      "name": "_plus49", 
      "inputs": [[252, 0], [255, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "Activation", 
      "param": {"act_type": "tanh"}, 
      "name": "activation124", 
      "inputs": [[256, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "_Mul", 
      "param": {}, 
      "name": "_mul74", 
      "inputs": [[250, 0], [257, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "FullyConnected", 
      "param": {
        "no_bias": "False", 
        "num_hidden": "1024"
      }, 
      "name": "ptb_lstm_14_h2h", 
      "inputs": [[258, 0], [100, 0], [101, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "_Plus", 
      "param": {}, 
      "name": "_plus52", 
      "inputs": [[59, 0], [259, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "SliceChannel", 
      "param": {"num_outputs": "4"}, 
      "name": "ptb_lstm_14_gates", 
      "inputs": [[260, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "Activation", 
      "param": {"act_type": "sigmoid"}, 
      "name": "activation133", 
      "inputs": [[261, 3]], 
      "backward_source_id": -1
    }, 
    {
      "op": "Activation", 
      "param": {"act_type": "sigmoid"}, 
      "name": "activation132", 
      "inputs": [[261, 2]], 
      "backward_source_id": -1
    }, 
    {
      "op": "_Mul", 
      "param": {}, 
      "name": "_mul78", 
      "inputs": [[263, 0], [256, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "Activation", 
      "param": {"act_type": "sigmoid"}, 
      "name": "activation130", 
      "inputs": [[261, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "Activation", 
      "param": {"act_type": "tanh"}, 
      "name": "activation131", 
      "inputs": [[261, 1]], 
      "backward_source_id": -1
    }, 
    {
      "op": "_Mul", 
      "param": {}, 
      "name": "_mul79", 
      "inputs": [[265, 0], [266, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "_Plus", 
      "param": {}, 
      "name": "_plus53", 
      "inputs": [[264, 0], [267, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "Activation", 
      "param": {"act_type": "tanh"}, 
      "name": "activation134", 
      "inputs": [[268, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "_Mul", 
      "param": {}, 
      "name": "_mul80", 
      "inputs": [[262, 0], [269, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "FullyConnected", 
      "param": {
        "no_bias": "False", 
        "num_hidden": "1024"
      }, 
      "name": "ptb_lstm_15_h2h", 
      "inputs": [[270, 0], [100, 0], [101, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "_Plus", 
      "param": {}, 
      "name": "_plus56", 
      "inputs": [[56, 0], [271, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "SliceChannel", 
      "param": {"num_outputs": "4"}, 
      "name": "ptb_lstm_15_gates", 
      "inputs": [[272, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "Activation", 
      "param": {"act_type": "sigmoid"}, 
      "name": "activation143", 
      "inputs": [[273, 3]], 
      "backward_source_id": -1
    }, 
    {
      "op": "Activation", 
      "param": {"act_type": "sigmoid"}, 
      "name": "activation142", 
      "inputs": [[273, 2]], 
      "backward_source_id": -1
    }, 
    {
      "op": "_Mul", 
      "param": {}, 
      "name": "_mul84", 
      "inputs": [[275, 0], [268, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "Activation", 
      "param": {"act_type": "sigmoid"}, 
      "name": "activation140", 
      "inputs": [[273, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "Activation", 
      "param": {"act_type": "tanh"}, 
